# Feb 9th 2020

### Pivot Table

In [1]:
import pandas as pd
pv = pd.read_csv('weather.csv')
print(pv)

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [11]:
pv.pivot(index ="city", columns ='date', values = "humidity")

date      5/1/2017  5/2/2017  5/3/2017
city
beijing         26        30        35
mumbai          80        83        85
new york        56        58        60

___

In [17]:
df=pd.read_csv('weather_2.csv')
df.tail()

       date      city  temperature  humidity
3  5/2/2017  new york           72        62
4  5/1/2017    mumbai           75        80
5  5/1/2017    mumbai           78        83
6  5/2/2017    mumbai           82        85
7  5/2/2017    mumbai           80        26

In [24]:
df.pivot_table(index='city', columns='date', aggfunc='sum', margins=True)

         humidity               temperature
date     5/1/2017 5/2/2017  All    5/1/2017 5/2/2017  All
city
mumbai        163      111  274         153      162  315
new york      110      122  232         126      142  268
All           273      233  506         279      304  583

___

In [25]:
grp = pd.read_csv('weather_3.csv')
grp

        date      city  temperature  humidity
0   5/1/2017  new york           65        56
1   5/2/2017  new york           61        54
2   5/3/2017  new york           70        60
3  12/1/2017  new york           30        50
4  12/2/2017  new york           28        52
5  12/3/2017  new york           25        51

In [29]:
grp['date']=pd.to_datetime(grp.date)

In [33]:
type(grp['date'])

pandas.core.series.Series

In [32]:
type(grp['date'][0])

pandas._libs.tslibs.timestamps.Timestamp

In [37]:
grp.pivot_table(index=pd.Grouper(freq='M', key='date'),columns='city')

             humidity temperature
city         new york    new york
date
2017-05-31  56.666667   65.333333
2017-12-31  51.000000   27.666667